УчетВУправляющихДляГит1/src/Catalogs/КВП_НормыПотребленияУслуг/КВП_НормыПотребленияУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КВП_НормыПотребленияУслуг</name>
  <owners>Catalog.КВП_Услуги</owners>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.КВП_ОснованияНормПотребления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНастройки</name>
    <type>
      <types>EnumRef.КВП_ВариантыНастроекРасчетаНормативовПотребления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлощади</name>
    <type>
      <types>CatalogRef.УПЖКХ_ВидыПлощадей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлощадиЗдания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьПриРасчетеЛьготНормой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Норма</name>
    <type>
      <types>CatalogRef.КВП_НормыПотребленияУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЖильцов</name>
    <type>
      <types>EnumRef.УПЖКХ_ВидыЖильцов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОпределенияКоличестваЖильцовПриОтсутствииПроживающихИлиЗарегистрированных</name>
    <type>
      <types>EnumRef.УПЖКХ_ВариантыРасчетаНормативаПриОтсутствииЖильцов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаНаЛицевойСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаДляВЕЖ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФормула</name>
    <comment>Помечен на удаление в 3.0.65.9</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРасширеннаяНастройка</name>
    <comment>2.0.54.4</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПриОтсутствииСчитатьНаОдного</name>
    <comment>Помечен на удаление в 3.0.48.1</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.УПЖКХ_ВидыПлощадей</types>
        <types>EnumRef.УПЖКХ_ВидыЖильцов</types>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <types>CatalogRef.КВП_ТипыПлощадейЗдания</types>
        <types>ChartOfCharacteristicTypesRef.УдалитьСвойстваОбъектов</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляТипаЗначения</name>
      <type>
        <types>CatalogRef.УПЖКХ_ВидыПлощадей</types>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <types>CatalogRef.КВП_ТипыПлощадейЗдания</types>
        <types>ChartOfCharacteristicTypesRef.УдалитьСвойстваОбъектов</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеТипа</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВводДиапазона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияСсылкаБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмерыНорм</name>
    <attributes>
      <name>НомерСтрокиТЧ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Любое значение - значение или нижняя граница диапазона, &quot;_Другие_&quot; - остальные значения, которые не указаны.</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>6</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФлагДругиеЗначения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение2</name>
      <comment>0 - интервал и верхняя граница не используются, -1 - верхнее значение не установлено, другие значения - значение верхней границы диапазона.</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>6</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьТаблицаПоказателейРасчета</name>
    <comment>Помечен на удаление в 3.0.65.9</comment>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательРасчета</name>
      <type>
        <types>CatalogRef.УПЖКХ_ВидыПлощадей</types>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <types>CatalogRef.КВП_ТипыПлощадейЗдания</types>
        <types>ChartOfCharacteristicTypesRef.УдалитьСвойстваОбъектов</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Enums/КВП_ВариантыНастроекРасчетаНормативовПотребления/КВП_ВариантыНастроекРасчетаНормативовПотребления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КВП_ВариантыНастроекРасчетаНормативовПотребления</name>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Расширенный</name>
  </enumValues>
  <enumValues>
    <name>Формула</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/КВП_НормыПотребленияУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

// Процедура возникает перед записью элемента.
Процедура ПередЗаписью(Отказ)
	
	// Очистим неиспользуемые реквизиты.
	Если ВариантНастройки = Перечисления.КВП_ВариантыНастроекРасчетаНормативовПотребления.Расширенный Тогда
		Размер = 0;
		ФормулаРасчета = "";
	ИначеЕсли ВариантНастройки = Перечисления.КВП_ВариантыНастроекРасчетаНормативовПотребления.Формула Тогда
		Размер = 0;
		Характеристики.Очистить();
		РазмерыНорм.Очистить();
	Иначе
		Характеристики.Очистить();
		РазмерыНорм.Очистить();
		ФормулаРасчета = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
